//**************************************************
//
// FPG制作 ( score.h )
// Author  : katsuki mizuki
//
//**************************************************
#ifndef _SCORE_H_	// このマクロ定義がされてなかったら
#define _SCORE_H_	// ２重インクルード防止のマクロ定義

//==================================================
// プロトタイプ宣言
//==================================================
//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitScore(void);

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitScore(void);

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateScore(void);

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawScore(void);

//--------------------------------------------------
// セット数を0にする
// 引数  : int nPlayerNo / 何番目のプレイヤーか
//--------------------------------------------------
void ZeroSetScore(int nPlayerNo);

//--------------------------------------------------
// ポイント数を0にする
// 引数  : int nPlayerNo / 何番目のプレイヤーか
//--------------------------------------------------
void ZeroPointScore(int nPlayerNo);

//--------------------------------------------------
// セット数を加算
// 引数1  : int nPlayerNo / 何番目のプレイヤーか
// 引数2  : int nValue / 加算する値
//--------------------------------------------------
void AddSetScore(int nPlayerNo, int nValue);

//--------------------------------------------------
// ポイント数を加算
// 引数1  : int nPlayerNo / 何番目のプレイヤーか
// 引数2  : int nValue / 加算する値
//--------------------------------------------------
void AddPointScore(int nPlayerNo, int nValue);

//--------------------------------------------------
// セット数の取得
// 引数  : int nPlayerNo / 何番目のプレイヤーか
// 返値  : int / セット数
//--------------------------------------------------
int GetSetScore(int nPlayerNo);

//--------------------------------------------------
// ポイント数の取得
// 引数  : int nPlayerNo / 何番目のプレイヤーか
// 返値  : int / ポイント数
//--------------------------------------------------
int GetPointScore(int nPlayerNo);

#endif // !_SCORE_H_
